<html>
    <head>
        <link href="https://fonts.googleapis.com/css?family=Montserrat&display=swap" rel="stylesheet">
        <style>
            h1{
                font-family: 'Montserrat', sans-serif;
            }
            p{
                font-family: 'Montserrat', sans-serif; 
            }
            li{
                font-family: 'Montserrat', sans-serif;
            }
            a{
                font-family: 'Montserrat', sans-serif;
            }
        </style>
    </head>
    <body>
        <h1>Men&uacute; Principal</h1>
        <hr>
        <p>El men&uacute; principal de nuestra aplicaci&oacute;n de reserva de hoteles, se basa en cuatro botones.</p>
        <ul>
            <hr>
            <li style="font-size: 30px">Bot&oacute;n de Reserva de Habitaciones</li>
            <p> Este bot&oacute;n nos enlaza la ventana de men&uacute; principal con una nueva ventana, la de reserva de habitaciones, la cual nos pedir&aacute; una serie de datos para realizar una reserva de habitaci&oacute;n.
            Para ver informaci&oacute;n mas detallada sobre la reservas de habitaciones haga clic en el siguiente enlace: <a href="ReservaHabitaciones.html">ayuda para reservar habitaciones</a>.</p>
            <hr>
            <li style="font-size: 30px">Bot&oacute;n de Reserva del Sal&oacute;n</li>
            <p>Con este segundo bot&oacute;n creamos un enlace a la ventana de reserva del sal&oacute;n Habana, en la cual, al igual que en la reserva de habitaciones, nos pedir&aacute; una serie de datos para realizar una reserva del sal&oacute;n Habana.Para ver informaci&oacute;n mas detallada a cerca de la reserva del sal&oacute;n Habana acceda a <a href="ReservaSalon.html">reserva del sal&oacute;n Habana</a>.</p>
            <hr>
            <li style="font-size: 30px">Bot&oacute;n desplegable de informes de clientes</li>
            <p>La funci&oacute;n de este bot&oacute;n desplegable es la de crear un informe, que puede ser uno de los siguientes:</p>
            <ul>
                <li style="margin-left: 10px; margin-bottom: 10px">Listado de clientes por orden alfab&eacute;tico.</li>
                <li style="margin-left: 10px; margin-bottom: 10px">Listado de reservas de habitaci&oacute;n ordenadas por clientes y fechas de entrada.</li>
                <li style="margin-left: 10px; margin-bottom: 10px">Listado de reservas de sal&oacute;n ordenadas por clientes y fechas de entrada.</li>
            </ul>
           
            <hr>
            <li style="font-size: 30px">Bot&oacute;n de ayuda al usuario</li>
            <p>Este &uacute;ltimo bot&oacute;n le abre a usted, el usuario, la documentaci&oacute;n de la aplicaci&oacute;n, donde puede ver y analizar como funciona nuestra aplicaci&oacute;n, en que versi&oacute;n se encuentra, quienes crearon la aplicaci&oacute;n y  ayudas para aprender a utilizar nuestra aplicaci&oacute;n</p>
            <p></p>
        </ul>
        <ul>
            <li><a href="introduccion.html">Volver al menu de ayuda</a></li>
        </ul>
        
    </body>
</html>